nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/dma/processor/dma_p32mz0512efe144.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _DMA_P32MZ0512EFE144_H
#define _DMA_P32MZ0512EFE144_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    DMA_ID_0 = _DMAC_BASE_ADDRESS,
    DMA_NUMBER_OF_MODULES = 1

} DMA_MODULE_ID;

typedef enum {

    DMA_CHANNEL_0 = 0x0,
    DMA_CHANNEL_1 = 0x1,
    DMA_CHANNEL_2 = 0x2,
    DMA_CHANNEL_3 = 0x3,
    DMA_CHANNEL_4 = 0x4,
    DMA_CHANNEL_5 = 0x5,
    DMA_CHANNEL_6 = 0x6,
    DMA_CHANNEL_7 = 0x7,
    DMA_NUMBER_OF_CHANNELS = 0x8

} DMA_CHANNEL;

typedef enum {

    DMA_CHANNEL_0_INT_SOURCE = 134,
    DMA_CHANNEL_1_INT_SOURCE = 135,
    DMA_CHANNEL_2_INT_SOURCE = 136,
    DMA_CHANNEL_3_INT_SOURCE = 137,
    DMA_CHANNEL_4_INT_SOURCE = 138,
    DMA_CHANNEL_5_INT_SOURCE = 139,
    DMA_CHANNEL_6_INT_SOURCE = 140,
    DMA_CHANNEL_7_INT_SOURCE = 141

} DMA_CHANNEL_INT_SOURCE;

typedef enum {

    DMA_CHANNEL_PRIORITY_0 = 0x0,
    DMA_CHANNEL_PRIORITY_1 = 0x1,
    DMA_CHANNEL_PRIORITY_2 = 0x2,
    DMA_CHANNEL_PRIORITY_3 = 0x3

} DMA_CHANNEL_PRIORITY;

typedef enum {

    DMA_CHANNEL_TRIGGER_TRANSFER_START = 0x0,
    DMA_CHANNEL_TRIGGER_TRANSFER_ABORT = 0x1,
    DMA_CHANNEL_TRIGGER_PATTERN_MATCH_ABORT = 0x2

} DMA_CHANNEL_TRIGGER_TYPE;

typedef enum {

    DMA_TRIGGER_SOURCE_NONE = -1,
    DMA_TRIGGER_TIMER_CORE = 0,
    DMA_TRIGGER_SOFTWARE_0 = 1,
    DMA_TRIGGER_SOFTWARE_1 = 2,
    DMA_TRIGGER_EXTERNAL_0 = 3,
    DMA_TRIGGER_EXTERNAL_1 = 8,
    DMA_TRIGGER_EXTERNAL_2 = 13,
    DMA_TRIGGER_EXTERNAL_3 = 18,
    DMA_TRIGGER_EXTERNAL_4 = 23,
    DMA_TRIGGER_TIMER_1 = 4,
    DMA_TRIGGER_TIMER_2 = 9,
    DMA_TRIGGER_TIMER_3 = 14,
    DMA_TRIGGER_TIMER_4 = 19,
    DMA_TRIGGER_TIMER_5 = 24,
    DMA_TRIGGER_TIMER_6 = 28,
    DMA_TRIGGER_TIMER_7 = 32,
    DMA_TRIGGER_TIMER_8 = 36,
    DMA_TRIGGER_TIMER_9 = 40,
    DMA_TRIGGER_INPUT_CAPTURE_1 = 6,
    DMA_TRIGGER_INPUT_CAPTURE_2 = 11,
    DMA_TRIGGER_INPUT_CAPTURE_3 = 16,
    DMA_TRIGGER_INPUT_CAPTURE_4 = 21,
    DMA_TRIGGER_INPUT_CAPTURE_5 = 26,
    DMA_TRIGGER_INPUT_CAPTURE_6 = 30,
    DMA_TRIGGER_INPUT_CAPTURE_7 = 34,
    DMA_TRIGGER_INPUT_CAPTURE_8 = 38,
    DMA_TRIGGER_INPUT_CAPTURE_9 = 42,
    DMA_TRIGGER_INPUT_CAPTURE_1_ERROR = 5,
    DMA_TRIGGER_INPUT_CAPTURE_2_ERROR = 10,
    DMA_TRIGGER_INPUT_CAPTURE_3_ERROR = 15,
    DMA_TRIGGER_INPUT_CAPTURE_4_ERROR = 20,
    DMA_TRIGGER_INPUT_CAPTURE_5_ERROR = 25,
    DMA_TRIGGER_INPUT_CAPTURE_6_ERROR = 29,
    DMA_TRIGGER_INPUT_CAPTURE_7_ERROR = 33,
    DMA_TRIGGER_INPUT_CAPTURE_8_ERROR = 37,
    DMA_TRIGGER_INPUT_CAPTURE_9_ERROR = 41,
    DMA_TRIGGER_OUTPUT_COMPARE_1 = 7,
    DMA_TRIGGER_OUTPUT_COMPARE_2 = 12,
    DMA_TRIGGER_OUTPUT_COMPARE_3 = 17,
    DMA_TRIGGER_OUTPUT_COMPARE_4 = 22,
    DMA_TRIGGER_OUTPUT_COMPARE_5 = 27,
    DMA_TRIGGER_OUTPUT_COMPARE_6 = 31,
    DMA_TRIGGER_OUTPUT_COMPARE_7 = 35,
    DMA_TRIGGER_OUTPUT_COMPARE_8 = 39,
    DMA_TRIGGER_OUTPUT_COMPARE_9 = 43,
    DMA_TRIGGER_SPI_1_ERROR = 109,
    DMA_TRIGGER_SPI_1_RECEIVE = 110,
    DMA_TRIGGER_SPI_1_TRANSMIT = 111,
    DMA_TRIGGER_SPI_2_ERROR = 142,
    DMA_TRIGGER_SPI_2_RECEIVE = 143,
    DMA_TRIGGER_SPI_2_TRANSMIT = 144,
    DMA_TRIGGER_SPI_3_ERROR = 154,
    DMA_TRIGGER_SPI_3_RECEIVE = 155,
    DMA_TRIGGER_SPI_3_TRANSMIT = 156,
    DMA_TRIGGER_SPI_4_ERROR = 163,
    DMA_TRIGGER_SPI_4_RECEIVE = 164,
    DMA_TRIGGER_SPI_4_TRANSMIT = 165,
    DMA_TRIGGER_SPI_5_ERROR = 176,
    DMA_TRIGGER_SPI_5_RECEIVE = 177,
    DMA_TRIGGER_SPI_5_TRANSMIT = 178,
    DMA_TRIGGER_SPI_6_ERROR = 185,
    DMA_TRIGGER_SPI_6_RECEIVE = 186,
    DMA_TRIGGER_SPI_6_TRANSMIT = 187,
    DMA_TRIGGER_I2C_1_ERROR = 115,
    DMA_TRIGGER_I2C_1_SLAVE = 116,
    DMA_TRIGGER_I2C_1_MASTER = 117,
    DMA_TRIGGER_I2C_2_ERROR = 148,
    DMA_TRIGGER_I2C_2_SLAVE = 149,
    DMA_TRIGGER_I2C_2_MASTER = 150,
    DMA_TRIGGER_I2C_3_ERROR = 160,
    DMA_TRIGGER_I2C_3_SLAVE = 161,
    DMA_TRIGGER_I2C_3_MASTER = 162,
    DMA_TRIGGER_I2C_4_ERROR = 173,
    DMA_TRIGGER_I2C_4_SLAVE = 174,
    DMA_TRIGGER_I2C_4_MASTER = 175,
    DMA_TRIGGER_I2C_5_ERROR = 182,
    DMA_TRIGGER_I2C_5_SLAVE = 183,
    DMA_TRIGGER_I2C_5_MASTER = 184,
    DMA_TRIGGER_USART_1_ERROR = 112,
    DMA_TRIGGER_USART_1_RECEIVE = 113,
    DMA_TRIGGER_USART_1_TRANSMIT = 114,
    DMA_TRIGGER_USART_2_ERROR = 145,
    DMA_TRIGGER_USART_2_RECEIVE = 146,
    DMA_TRIGGER_USART_2_TRANSMIT = 147,
    DMA_TRIGGER_USART_3_ERROR = 157,
    DMA_TRIGGER_USART_3_RECEIVE = 158,
    DMA_TRIGGER_USART_3_TRANSMIT = 159,
    DMA_TRIGGER_USART_4_ERROR = 170,
    DMA_TRIGGER_USART_4_RECEIVE = 171,
    DMA_TRIGGER_USART_4_TRANSMIT = 172,
    DMA_TRIGGER_USART_5_ERROR = 179,
    DMA_TRIGGER_USART_5_RECEIVE = 180,
    DMA_TRIGGER_USART_5_TRANSMIT = 181,
    DMA_TRIGGER_USART_6_ERROR = 188,
    DMA_TRIGGER_USART_6_RECEIVE = 189,
    DMA_TRIGGER_USART_6_TRANSMIT = 190,
    DMA_TRIGGER_CHANGE_NOTICE_A = 118,
    DMA_TRIGGER_CHANGE_NOTICE_B = 119,
    DMA_TRIGGER_CHANGE_NOTICE_C = 120,
    DMA_TRIGGER_CHANGE_NOTICE_D = 121,
    DMA_TRIGGER_CHANGE_NOTICE_E = 122,
    DMA_TRIGGER_CHANGE_NOTICE_F = 123,
    DMA_TRIGGER_CHANGE_NOTICE_G = 124,
    DMA_TRIGGER_CHANGE_NOTICE_H = 125,
    DMA_TRIGGER_CHANGE_NOTICE_J = 126,
    DMA_TRIGGER_CHANGE_NOTICE_K = 127,
    DMA_TRIGGER_DMA_0 = 134,
    DMA_TRIGGER_DMA_1 = 135,
    DMA_TRIGGER_DMA_2 = 136,
    DMA_TRIGGER_DMA_3 = 137,
    DMA_TRIGGER_DMA_4 = 138,
    DMA_TRIGGER_DMA_5 = 139,
    DMA_TRIGGER_DMA_6 = 140,
    DMA_TRIGGER_DMA_7 = 141,
    DMA_TRIGGER_COMPARATOR_1 = 130,
    DMA_TRIGGER_COMPARATOR_2 = 131,
    DMA_TRIGGER_ADC_1 = 44,
    DMA_TRIGGER_ADC1_DC1 = 46,
    DMA_TRIGGER_ADC1_DC2 = 47,
    DMA_TRIGGER_ADC1_DC3 = 48,
    DMA_TRIGGER_ADC1_DC4 = 49,
    DMA_TRIGGER_ADC1_DC5 = 50,
    DMA_TRIGGER_ADC1_DC6 = 51,
    DMA_TRIGGER_ADC1_DF1 = 52,
    DMA_TRIGGER_ADC1_DF2 = 53,
    DMA_TRIGGER_ADC1_DF3 = 54,
    DMA_TRIGGER_ADC1_DF4 = 55,
    DMA_TRIGGER_ADC1_DF5 = 56,
    DMA_TRIGGER_ADC1_DF6 = 57,
    DMA_TRIGGER_ADC1_DATA0 = 59,
    DMA_TRIGGER_ADC1_DATA1 = 60,
    DMA_TRIGGER_ADC1_DATA2 = 61,
    DMA_TRIGGER_ADC1_DATA3 = 62,
    DMA_TRIGGER_ADC1_DATA4 = 63,
    DMA_TRIGGER_ADC1_DATA5 = 64,
    DMA_TRIGGER_ADC1_DATA6 = 65,
    DMA_TRIGGER_ADC1_DATA7 = 66,
    DMA_TRIGGER_ADC1_DATA8 = 67,
    DMA_TRIGGER_ADC1_DATA9 = 68,
    DMA_TRIGGER_ADC1_DATA10 = 69,
    DMA_TRIGGER_ADC1_DATA11 = 70,
    DMA_TRIGGER_ADC1_DATA12 = 71,
    DMA_TRIGGER_ADC1_DATA13 = 72,
    DMA_TRIGGER_ADC1_DATA14 = 73,
    DMA_TRIGGER_ADC1_DATA15 = 74,
    DMA_TRIGGER_ADC1_DATA16 = 75,
    DMA_TRIGGER_ADC1_DATA17 = 76,
    DMA_TRIGGER_ADC1_DATA18 = 77,
    DMA_TRIGGER_ADC1_DATA19 = 78,
    DMA_TRIGGER_ADC1_DATA20 = 79,
    DMA_TRIGGER_ADC1_DATA21 = 80,
    DMA_TRIGGER_ADC1_DATA22 = 81,
    DMA_TRIGGER_ADC1_DATA23 = 82,
    DMA_TRIGGER_ADC1_DATA24 = 83,
    DMA_TRIGGER_ADC1_DATA25 = 84,
    DMA_TRIGGER_ADC1_DATA26 = 85,
    DMA_TRIGGER_ADC1_DATA27 = 86,
    DMA_TRIGGER_ADC1_DATA28 = 87,
    DMA_TRIGGER_ADC1_DATA29 = 88,
    DMA_TRIGGER_ADC1_DATA30 = 89,
    DMA_TRIGGER_ADC1_DATA31 = 90,
    DMA_TRIGGER_ADC1_DATA32 = 91,
    DMA_TRIGGER_ADC1_DATA33 = 92,
    DMA_TRIGGER_ADC1_DATA34 = 93,
    DMA_TRIGGER_ADC1_DATA35 = 94,
    DMA_TRIGGER_ADC1_DATA36 = 95,
    DMA_TRIGGER_ADC1_DATA37 = 96,
    DMA_TRIGGER_ADC1_DATA38 = 97,
    DMA_TRIGGER_ADC1_DATA39 = 98,
    DMA_TRIGGER_ADC1_DATA40 = 99,
    DMA_TRIGGER_ADC1_DATA41 = 100,
    DMA_TRIGGER_ADC1_DATA42 = 101,
    DMA_TRIGGER_ADC1_DATA43 = 102,
    DMA_TRIGGER_ADC1_DATA44 = 103,
    DMA_TRIGGER_CORE_PERF_COUNT = 104,
    DMA_TRIGGER_CORE_FAST_DEBUG_CHAN = 105,
    DMA_TRIGGER_SYSTEM_BUS_PROTECTION = 106,
    DMA_TRIGGER_PARALLEL_PORT = 128,
    DMA_TRIGGER_RTCC = 166,
    DMA_TRIGGER_FLASH_CONTROL = 167,
    DMA_TRIGGER_USB_1 = 132,
    DMA_TRIGGER_USB_DMA = 133,
    DMA_TRIGGER_ETH_1 = 153,
    DMA_TRIGGER_PARALLEL_PORT_ERROR = 129,
    DMA_TRIGGER_PREFETCH = 168,
    DMA_TRIGGER_SQI1 = 169

} DMA_TRIGGER_SOURCE;

